

num3 = input('請輸入身分證末3碼: ')



week1 = {
        "國旅券": ["21", "32", "98", "67", "97", "410"],
        "i原券": ["64", "85"],
		"農遊券" :  ["89", "32","54","597","453","152"],
        "藝FUN數位" : ["96","15","07","30","73","98","19","11"],
        "藝FUN紙本" : ["39","37","23","36","79","08","14","75"],
        "動滋券" : ["97","13","19","55","71","93","381","734","644","453","985"],
        "客庄券" : ["81","900"],
        "地方創生券" : ["081","105","594","188","089","396","521","467","912","798","358","441","367","941","335"]}



#順序 國旅, I原, 農遊, 藝FUN數位, 藝FUN紙本, 動滋, 客庄, 地方創生


week2 =  {"國旅券": ["87", "04", "40", "29", "71"],
                 "i原券": ["12", "59"],
		        "農遊券" :  ["50", "13"],
                "藝FUN數位" : ["78","00","39","22","61","23","15"],
                "藝FUN紙本" : ["37","76","31","06","51","65","81"],
                "動滋券" : ["91","11","04","18","57","498","756"],
                "客庄券" : ["11","439","841","052","206","161","457","205","012","293","446","589"]}
num_list = list()
for item in week1:
    num_list.append(item)
    for num in week1[item]:
        result = num
        num_list.append(result)
    print(num_list)
#
# Allresult = []
# for i in week1:
#     for r in range(len(week1[i])):
#         if week1[i][r] == num3 or week1[i][r] == num3[1:]:
#             result = '恭喜中了: {}!!'.format(i)
#             Allresult.append(result)
#         else:
#             #print('{}沒中獎'.format(i))
#             pass
#         print(Allresult)
# print('*'*50)
#
# for i in week2:
#     for r in range(len(week2[i])):
#         if week2[i][r] in num3:
#             print('恭喜中了: {}!!'.format(i))
#         else:
#             #print('沒中獎')
#             pass